<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"bc3925d8bc56f9eefed61a11314390775b2e8796df8ead3ecb04597da1377363","plan_job_ref":"Job Pull Request Checks #3850 at https://github.com/GSA-TTS/FAC/actions/runs/11466074670","plan_out_hash":"0a48db58b9b1cd7d54b54de84dbae62b15a164a6a62dad16b5b21886b083fc0a","plan_hash":"c68a04bcb1ab71dcbc6393a89f87868e95a3d2c69e5c9f1989929067076879b9","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 6 to add, 4 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.environments["dev"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
        name                     = "dev"
#        (11 unchanged attributes hidden)
    }

  # module.environments["dev"].local_file.main-tf will be created
+   resource "local_file" "main-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            # Add resources to this module describing what you want in the corresponding 
            # space in cloud.gov. You should probably just reference a shared module as in the
            # example below to keep consistency across spaces, but you can also vary the 
            # content for each environment as needed.
            
            module "dev" {
              source        = "../shared/modules/env"
              cf_space_name = "dev"
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../dev/dev.tf-example"
+       id                   = (known after apply)
    }

  # module.environments["dev"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../dev/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["preview"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "c21cdcb1-b760-4f3e-968d-469819b448e9"
        name                     = "preview"
#        (11 unchanged attributes hidden)
    }

  # module.environments["preview"].local_file.main-tf will be created
+   resource "local_file" "main-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            # Add resources to this module describing what you want in the corresponding 
            # space in cloud.gov. You should probably just reference a shared module as in the
            # example below to keep consistency across spaces, but you can also vary the 
            # content for each environment as needed.
            
            module "preview" {
              source        = "../shared/modules/env"
              cf_space_name = "preview"
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../preview/preview.tf-example"
+       id                   = (known after apply)
    }

  # module.environments["preview"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../preview/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["production"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
        name                     = "production"
#        (11 unchanged attributes hidden)
    }

  # module.environments["production"].local_file.providers-tf must be replaced
-/+ resource "local_file" "providers-tf" {
!~      content              = <<-EOT # forces replacement
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
-                 version = "~>0.51.3"
+                 version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
      ~ content_base64sha256 = "dEVfx927iJVPf2uxtjqbgbhnEByO5dp1IY7hGS9sCqM=" -> (known after apply)
      ~ content_base64sha512 = "c4fEMRwfcc+eS5C9MX9khv+aKbdbU3EMGxh5DvdmY2qrZFr56CFhUEPp04ze5hEM3aeRuRuwU9ZyMejufJ5twQ==" -> (known after apply)
      ~ content_md5          = "37a2cf9b433c48f279dd4cf77dd24414" -> (known after apply)
      ~ content_sha1         = "b3648511bf18110578ac2822a4297d05b5812280" -> (known after apply)
      ~ content_sha256       = "74455fc7ddbb88954f7f6bb1b63a9b81b867101c8ee5da75218ee1192f6c0aa3" -> (known after apply)
      ~ content_sha512       = "7387c4311c1f71cf9e4b90bd317f6486ff9a29b75b53710c1b18790ef766636aab645af9e821615043e9d38cdee6110cdda791b91bb053d67231e8ee7c9e6dc1" -> (known after apply)
      ~ id                   = "****************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.environments["staging"].cloudfoundry_space.space will be updated in-place
  ~ resource "cloudfoundry_space" "space" {
      + delete_recursive_allowed = true
        id                       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
        name                     = "staging"
        # (11 unchanged attributes hidden)
    }

  # module.environments["staging"].local_file.providers-tf must be replaced
-/+ resource "local_file" "providers-tf" {
      ~ content              = <<-EOT # forces replacement
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
          -       version = "~>0.51.3"
          +       version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
!~      content_base64sha256 = "dEVfx927iJVPf2uxtjqbgbhnEByO5dp1IY7hGS9sCqM=" -> (known after apply)
!~      content_base64sha512 = "c4fEMRwfcc+eS5C9MX9khv+aKbdbU3EMGxh5DvdmY2qrZFr56CFhUEPp04ze5hEM3aeRuRuwU9ZyMejufJ5twQ==" -> (known after apply)
!~      content_md5          = "37a2cf9b433c48f279dd4cf77dd24414" -> (known after apply)
!~      content_sha1         = "b3648511bf18110578ac2822a4297d05b5812280" -> (known after apply)
!~      content_sha256       = "74455fc7ddbb88954f7f6bb1b63a9b81b867101c8ee5da75218ee1192f6c0aa3" -> (known after apply)
!~      content_sha512       = "7387c4311c1f71cf9e4b90bd317f6486ff9a29b75b53710c1b18790ef766636aab645af9e821615043e9d38cdee6110cdda791b91bb053d67231e8ee7c9e6dc1" -> (known after apply)
!~      id                   = "****************************************" -> (known after apply)
#        (3 unchanged attributes hidden)
    }

Plan: 6 to add, 4 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3850](https://github.com/GSA-TTS/FAC/actions/runs/11466074670)